package kyu_8;

/*
В этом Ката мы передаем число (n) в функцию.

Ваш код определит, является ли переданное число четным (или нет).

Функция должна возвращать либо значение true, либо значение false.

Числа могут быть положительными или отрицательными, целыми или с плавающей запятой.

Значения с плавающей запятой, не равные нулю, считаются неравномерными для этого ката.
 */
public class Is_it_even {

    public boolean isEven(double n) {
        // Your awesome code here!
        return n % 2 == 0;
    }
}
